milling/laminarRhoSimpleFoamLshape/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 320;

boundaryField
{
    rotor
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    stator
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    axis
    {
        type            zeroGradient;  
    } 
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
