milling/laminarRhoSimpleFoamLshape/system/controlDict
 /*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    object    controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
    #includeFunc streamlines

    fieldMinMax1
    {
       // Mandatory entries (unmodifiable)
       type        fieldMinMax;
       libs        (fieldFunctionObjects);

       // Mandatory entries (runtime modifiable)
       mode        magnitude;
       fields      (U p T rho);

       // Optional entries (runtime modifiable)
       location    true;

       // Optional (inherited) entries
    }

    limitFields1
    {
       // Mandatory entries (unmodifiable)
       type            limitFields;
       libs            (fieldFunctionObjects);

       // Mandatory entries (runtime modifiable)
       fields          (U);
       limit           max;
       max             100;

       // Optional (inherited) entries
       region          region0;
       enabled         true;
       log             true;
       timeStart       0;
       timeEnd         1000;
       executeControl  timeStep;
       executeInterval 1;
       writeControl    timeStep;
       writeInterval   100;
    }
}
// ************************************************************************* //
