milling/laminarRhoSimpleFoamLshape/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwind limited;

    div(phi,e)          bounded Gauss linearUpwind limited;
    div(phi,Ekp)        bounded Gauss linearUpwind limited;

    turbulence          bounded Gauss linearUpwind limited;
    div(phi,epsilon)    $turbulence;
    div(phi,k)          $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
