milling/laminarRhoSimpleFoamLshape/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           1e-6;
    };

    "(U|e)"  
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    };
}

// Settings from squareBendLiq tutorial - only poorly understood 
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1; // 0.9; // 0.1;
    pMaxFactor      1.5; // 1.1; // 1.5;

    transonic       no;
    consistent      no;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(e|h)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        e               0.7;
        k               0.7;
        epsilon         0.7;
    }
}

// ************************************************************************* //
